
&НаСервере
Процедура ОбновитьКартуМаршрутаНаСервере()
	
	БизнесПроцессОбъект = РеквизитФормыВЗначение("Объект");
	КартаМаршрута = БизнесПроцессОбъект.ПолучитьКартуМаршрута();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьКартуМаршрута(Команда)
	ОбновитьКартуМаршрутаНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	КартаМаршрута =  ТекущийОбъект.ПолучитьКартуМаршрута();
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	КартаМаршрута =  ТекущийОбъект.ПолучитьКартуМаршрута();

КонецПроцедуры
